config.org
* Sinofine's configuration towards DOOM Emacs.
Experimental.
#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;; Speed up.
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq gc-cons-threshold 100000000)
(benchmark-init/activate)
(add-hook 'after-init-hook 'benchmark-init/deactivate)
#+end_src
** Identificaion
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Sinofine Lotusie"
      user-mail-address "i@sinofine.me")
#+end_src

** Macros
*** Add fs to hook.
#+begin_src emacs-lisp :tangle yes
(defmacro add-fs-to-hook (hook &rest funcs)
  "Add functions to hook. A function is either an unquoted token, or a form.
If it's a token, then its treated as a function and enabled. Otherwise, the form is run."
  `(add-hook ,hook
    (fn ,@(mapcar (lambda (el)
                    (if (listp el)
                        el
                      (list el 1)))
                  funcs))))
;; Why?
(defmacro fn (&rest forms)
  (declare (indent 0))
  `(lambda () ,@forms))
#+end_src

** General Settings
*** Set fill column.
#+begin_src emacs-lisp :tangle yes
(setq fill-column 70)
#+end_src
*** Do not confirm kill.
#+begin_src emacs-lisp :tangle yes
(setq confirm-kill-emacs nil)
#+end_src
*** Keybindings.
#+begin_src emacs-lisp :tangle yes
(map! :leader
      :desc "Open nix folder"
      :n "nix"
      (lambda ()
        (interactive)
        (doom-project-find-file "~/nixconfig")))
#+end_src
** Graphics
*** Set theme.
#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-ayu-light)
#+end_src

*** Set splash screen image & modify padding.
#+begin_src emacs-lisp :tangle yes
(setq fancy-splash-image (concat doom-user-dir "logo/hfut.svg"))
(setq +doom-dashboard-banner-padding '(2 . 3))
#+end_src

*** Enable line numbers, set it to relative.
#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type 'relative)
#+end_src
***** And set styles of line numbers.
#+begin_src emacs-lisp :tangle yes
(set-face-attribute 'line-number nil
                    :italic nil)
#+end_src

*** Set frame size & enable transparent background.
#+begin_src emacs-lisp :tangle yes
(setq default-frame-alist '((width . 90)
                            (height . 25)
                            ;; (alpha-background . 90)
                            ))
#+end_src

*** Enable precise scroll.
#+begin_src emacs-lisp :tangle no
(pixel-scroll-precision-mode)
#+end_src

*** Customize dashboard menus.
#+begin_src emacs-lisp :tangle yes
(setq +doom-dashboard-menu-sections
      '(
        ("Recently opened files" :icon
         (nerd-icons-faicon "nf-fa-file_text" :face 'doom-dashboard-menu-title)
         :action recentf-open-files)
        ("Open org-agenda" :icon
         (nerd-icons-octicon "nf-oct-calendar" :face 'doom-dashboard-menu-title)
         :when
         (fboundp 'org-agenda)
         :action org-agenda)
        ("Open telega" :icon
         (nerd-icons-faicon "nf-fae-telegram" :face 'doom-dashboard-menu-title)
         :action telega)
        ("Open project" :icon
         (nerd-icons-octicon "nf-oct-briefcase" :face 'doom-dashboard-menu-title)
         :action projectile-switch-project)
        ("Open private configuration" :icon
         (nerd-icons-octicon "nf-oct-tools" :face 'doom-dashboard-menu-title)
         :when
         (file-directory-p doom-user-dir)
         :action doom/open-private-config)
        ))
#+end_src

*** Set fonts
#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "Iosevka Comfy Motion" :size 18)
      doom-variable-pitch-font (font-spec :family "Iosevka Comfy Motion Duo"))
(add-hook! 'doom-load-theme-hook :append
           (set-face-attribute 'default nil :weight 'medium)
  (dolist (charset '(kana han cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font)
                      charset (font-spec :family "Noto Serif CJK SC")))
  (set-fontset-font (frame-parameter nil 'font) 'emoji (font-spec :family "Segoe UI Emoji")))
#+end_src
I do not use cnfonts to align fonts.
#+begin_src emacs-lisp :tangle no
(cnfonts-mode 1)
(setq cnfonts-personal-fontnames '(("Luxi Mono") ("HYXinRenWenSongW") () ())
      cnfonts-use-face-font-rescale t)
(defun init-cjk-fonts (_fsl)
  ;; (dolist (charset '(kana han cjk-misc bopomofo))
  ;;   (set-fontset-font (frame-parameter nil 'font)
  ;;     charset (font-spec :family "HYXinRenWenSongW" :size 20)))
  (set-fontset-font (frame-parameter nil 'font) 'emoji (font-spec :family "Segoe UI Emoji"))
  )
(add-hook 'cnfonts-set-font-finish-hook 'init-cjk-fonts)
#+end_src

Define maps.
#+begin_src emacs-lisp :tangle no
(define-key cnfonts-mode-map (kbd "C--") #'cnfonts-decrease-fontsize)
(define-key cnfonts-mode-map (kbd "C-=") #'cnfonts-increase-fontsize)
#+end_src

*** Now playing
#+begin_src emacs-lisp :tangle yes
;;(require 'doom-modeline-now-playing)
;;(doom-modeline-now-playing-timer)
#+end_src
*** Enable time
#+begin_src emacs-lisp :tangle yes
(require 'cn-zodiac-time)
(setq display-time-string-forms '((cn-zodiac-time 'branches)))
(display-time-mode)
#+end_src
*** Input method
#+begin_src emacs-lisp :tangle yes
;; (setq pyim-default-scheme 'pyim-shuangpin)
(require 'rime)
(setq default-input-method "rime")
(setq rime-user-data-dir "~/.config/rime"
      rime-share-data-dir "/etc/profiles/per-user/sinofine/share/rime-data"
      rime-show-candidate 'posframe
      rime-posframe-style 'simple
      rime-show-preedit 'inline)
#+end_src
** Packages
*** Org mode.
**** Do not evaluate code blocks when exporting.
#+begin_src emacs-lisp :tangle yes
(setq org-export-use-babel nil)
#+end_src
**** Do not confirm before evaluation.
#+begin_src emacs-lisp :tangle yes
(setq org-confirm-babel-evaluate nil)
#+end_src
**** Show images when opening a file & after evaluating code blocks.
#+begin_src emacs-lisp :tangle yes
(setq org-startup-with-inline-images t)
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
#+end_src
**** LaTeX preview.
#+begin_src emacs-lisp :tangle yes
(setq org-latex-preview-default-process 'dvisvgm
      org-latex-preview-options
      '(:foreground auto
        :background "Transparent"
        :scale 1
        :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")
        :zoom 1.0)
      )
#+end_src
**** Set MathML processor.
#+begin_src emacs-lisp :tangle yes
(setq org-latex-to-mathml-convert-command
      "latexmlmath \"%i\" --presentationmathml=%o")
#+end_src
*** Telega.
#+begin_src emacs-lisp :tangle yes
(setq telega-emoji-use-images nil)
#+end_src

#+RESULTS:

**** Keymaps.
#+begin_src emacs-lisp :tangle yes
(map! :leader :desc "Open telega" :n "ot" 'telega)
#+end_src
**** Modify message faces.
#+begin_src emacs-lisp :tangle yes
;; (setq telega-avatar-workaround-gaps-for '(return t))
(add-hook 'telega-load-hook
          (lambda ()
            (set-face-attribute 'telega-msg-heading nil
                                :background nil
                                :underline 't
                                ;; :height 1.2
                                )
            (set-face-attribute 'telega-msg-inline-forward nil
                                ;; :background "light gray"
                                :underline nil
                                ;; :height 0.84
                                )
            (set-face-attribute 'telega-msg-inline-reply nil
                                ;; :background "light gray"
                                :underline nil
                                ;; :height 0.84
                                )
            ))
#+end_src


**** Modify brackets.
#+begin_src emacs-lisp :tangle no
(setq telega-brackets
      `(((chat (type private bot))
         ;; ,(concat (nerd-icons-mdicon "nf-md-robot_outline") " ")
         ,(concat " "
                  (nerd-icons-mdicon "nf-md-account"
                                     :face '(:foreground "#86dffd" :height 0.7))
                  " ") " ")
        ((chat (type basicgroup))
         ,(concat " "
                  (nerd-icons-mdicon "nf-md-account_multiple"
                                     :face '(:foreground "#70bcff" :height 0.7))
                  " ") " ")
        ((chat (type supergroup))
         ,(concat " "
                  (nerd-icons-mdicon "nf-md-account_multiple"
                                     :face '(:foreground "#70bcff" :height 0.7))
                  " ") " ")
        ((chat (type channel))
         ,(concat " "
                  (nerd-icons-faicon "nf-fa-feed"
                                     :face '(:foreground "#ffa95f" :height 0.7))
                  " ") " ")
        ((user (return t))
         ,(concat " "
                  (nerd-icons-mdicon "nf-md-account"
                                     :face '(:foreground "#86dffd" :height 0.7))
                  " ") " ")
        ((return t)
         ,(concat " "
                  (nerd-icons-faicon "nf-fa-question_circle"
                                     :face '(:foreground "#ff0000" :height 0.7))
                  " ") " "))
      )
#+end_src
**** Set bridge bots.
#+begin_src emacs-lisp :tangle yes
(require 'telega-bridge-bot)
(setq telega-bridge-bot-bridge-info-plist
      '(-1001773572820 ; id of the @emacs_china
        (420415423 ; id of the @matrix_t2bot
         ;; will fetch member info with this matrix room id
         (:type :matrix :chat-id "!EGzPXoyqkJdTByDCjD:mozilla.org"))
        -1001882351848
        (5846938060
         (:type :matrix :chat-id "!uoEcEMNaQYWmDWUQYY:matrix.org")))
      telega-bridge-bot-matrix-user "@sinofine:envs.net")
#+end_src
**** Set chatbuf window.
#+begin_src emacs-lisp :tangle yes
;; (setq telega-inserter-for-chat-button 'telega-ins--chat-full-2lines)
(setq telega-chat-button-width 15)
(setq telega-root-fill-column (+ 20 telega-chat-button-width))
(put (get 'telega-chat 'button-category-symbol)
    :inserter 'telega-ins--chat-full-2lines)
(setq switch-to-buffer-preserve-window-point t)
(setq telega-chat--display-buffer-action
    '((display-buffer-reuse-window display-buffer-use-some-window)))
#+end_src
*** AucTeX & CDLaTeX.
I hardly use ~\textsf~, but ideals love ~\mathfrak~.
#+begin_src emacs-lisp :tangle yes
(setq cdlatex-math-modify-alist '((102 "\\mathfrak" "\\textsf" t nil nil))
      cdlatex-math-symbol-alist '((111 "\\omega" "\\circ")))
#+end_src
Make completion smarter.
#+begin_src emacs-lisp :tangle yes
(setq TeX-parse-self t)
#+end_src
Set viewers.
#+begin_src emacs-lisp :tangle yes
(setq pdf-viewer-exec-alist '((sioyek . "Sioyek")
                              (zathura . "Zathura")
                              (evince . "evince")
                              (okular . "Okular")))
(setq my-pdf-viewer (->> pdf-viewer-exec-alist
                         (-first (-compose #'executable-find #'symbol-name #'car))
                         cdr))

(add-fs-to-hook 'LaTeX-mode-hook
                (setq TeX-view-program-selection
                      `((output-pdf ,my-pdf-viewer)
                        (output-dvi ,my-pdf-viewer)
                        (output-html "xdg-open")))
                auto-fill-mode)
#+end_src
*** Xenops. (That should be a perfect modern substitute for preview-latex)
My screen so big that xenops preview should be small.
#+begin_src emacs-lisp :tangle yes
(setq xenops-math-image-scale-factor .5)
#+end_src
**** Some hooks. (Do I really need xenops?)
#+begin_src emacs-lisp :tangle no
(add-hook 'latex-mode-hook #'xenops-mode)
(add-hook 'LaTeX-mode-hook #'xenops-mode)
(add-hook 'org-mode-hook #'xenops-mode)
#+end_src

*** WhizzyTeX. (Another TeX previewer, hard to install.)
#+begin_src emacs-lisp :tangle no
(load! "/home/sinofine/.local/share/whizzytex/emacs/whizzytex.el")
#+end_src

*** Sage mode. (Virtually I need a calculator.)
#+begin_src emacs-lisp :tangle no
(custom-set-variables
 '(sage-shell:use-prompt-toolkit nil)
 '(sage-shell:use-simple-prompt t)
 '(sage-shell:set-ipython-version-on-startup nil)
 '(sage-shell:check-ipython-version-on-startup nil))
(sage-shell:define-alias)
(add-hook 'sage-shell-mode-hook #'eldoc-mode)
(add-hook 'sage-shell:sage-mode-hook #'eldoc-mode)
#+end_src
**** Org mode associated.
#+begin_src emacs-lisp :tangle no
(setq org-babel-default-header-args:sage
      '((:session . t)
        (:results . "output")))
(with-eval-after-load "org"
  (define-key org-mode-map (kbd "C-c c")
              'ob-sagemath-execute-async))
#+end_src

*** Yas. (Do I really need that? Hope so.)
**** Set auto triggers.
#+begin_src emacs-lisp :tangle yes
(defun my-yas-try-expanding-auto-snippets ()
  (when (and (boundp 'yas-minor-mode) yas-minor-mode)
    (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
      (yas-expand))))
(add-hook 'post-command-hook #'my-yas-try-expanding-auto-snippets)
#+end_src
**** Disable backquote change warnings.
#+begin_src emacs-lisp :tangle yes
(add-to-list 'warning-suppress-types '(yasnippet backquote-change))
#+end_src
